#!/usr/bin/env python3
# -*- coding: utf-8 -*-
from kivy.app import App
from kivy.core.text import LabelBase
from kivy.uix.anchorlayout import AnchorLayout
from kivy.uix.gridlayout import GridLayout
from kivy.uix.label import Label
import pandas as pd

LabelBase.register(name="msyh",
                   fn_regular="./stock/gui/fonts/msyh.ttf")


class TableHeader(Label):
    pass


class Record(Label):
    pass


class CustomTable(AnchorLayout):
    def __init__(self, column_list, data, **kwargs):
        super().__init__(**kwargs)
        self.grid = MyGrid()
        self.grid.set_data(column_list, data)


class MyGrid(GridLayout):
    def __init__(self, **kwargs):
        super(MyGrid, self).__init__(**kwargs)
        self.column_list = None
        self.data = None
        self.df = None
        self.cols = 0
        self.rows = 0

    def set_data(self, column_list, data):
        self.column_list = column_list
        self.data = data
        self.df = pd.DataFrame(self.data)
        self.df = self.df[self.column_list]
        self.cols = len(self.column_list)
        self.rows = len(self.data)
        self.display_record()

    def display_record(self):
        self.clear_widgets()
        for i in range(len(self.data)):
            if i < 1:
                row = self.create_header()
            else:
                row = self.create_record(i)
            for item in row:
                self.add_widget(item)

    def create_header(self):
        header_list = []
        for i in self.column_list:
            header_list.append(TableHeader(text=i))
        return header_list

    def create_record(self, line_idx):
        item_list = []
        for col in self.column_list:
            item_list.append(Record(text=self.data[line_idx][col]))
        return item_list


class Test(App):
    main_layout = None

    def build(self):
        data = [
            {'过户费': '0', '剩余金额': '2000', '清算金额': '2000', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0', '成交金额': '0',
             '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0', '印花税': '0',
             '成交日期': '20160929', '规费': '0'},
            {'过户费': '0', '剩余金额': '1950', '清算金额': '-50', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0', '成交金额': '50',
             '净佣金': '0', '成交编号': '', '业务名称': '基金申购拨出', '证券名称': '工银香港中小盘股', '成交价格': '0', '证券代码': '002379', '附加费': '0',
             '印花税': '0', '成交日期': '20160929', '规费': '0'},
            {'过户费': '0', '剩余金额': '1900', '清算金额': '-50', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0', '成交金额': '50',
             '净佣金': '0', '成交编号': '', '业务名称': '基金申购拨出', '证券名称': '工银香港中小盘股', '成交价格': '0', '证券代码': '002379', '附加费': '0',
             '印花税': '0', '成交日期': '20160929', '规费': '0'},
            {'过户费': '0', '剩余金额': '1850', '清算金额': '-50', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0', '成交金额': '50',
             '净佣金': '0', '成交编号': '', '业务名称': '基金申购拨出', '证券名称': '交银环球', '成交价格': '0', '证券代码': '519696', '附加费': '0',
             '印花税': '0', '成交日期': '20160929', '规费': '0'},
            {'过户费': '0', '剩余金额': '1850', '清算金额': '0', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '1801000101', '业务名称': '指定交易', '证券名称': '登记指定', '成交价格': '0',
             '证券代码': '799999', '附加费': '0', '印花税': '0', '成交日期': '20160930', '规费': '0'},
            {'过户费': '0.01', '剩余金额': '1524.99', '清算金额': '-325.01', '结算费': '0', '剩余数量': '100', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '320', '净佣金': '4.97', '成交编号': '1801000262', '业务名称': '证券买入', '证券名称': '海南航空',
             '成交价格': '3.2', '证券代码': '600221', '附加费': '0', '印花税': '0', '成交日期': '20160930', '规费': '0.03'},
            {'过户费': '0', '剩余金额': '1290.99', '清算金额': '-234', '结算费': '0', '剩余数量': '100', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '229', '净佣金': '4.99', '成交编号': '1801001359', '业务名称': '证券买入', '证券名称': '海润光伏',
             '成交价格': '2.29', '证券代码': '600401', '附加费': '0', '印花税': '0', '成交日期': '20160930', '规费': '0.01'},
            {'过户费': '0', '剩余金额': '939.99', '清算金额': '-351', '结算费': '0', '剩余数量': '100', '股东代码': '0214229323',
             '成交数量': '100', '成交金额': '346', '净佣金': '4.96', '成交编号': 'DA000427', '业务名称': '证券买入', '证券名称': '大康农业',
             '成交价格': '3.46', '证券代码': '002505', '附加费': '0', '印花税': '0', '成交日期': '20160930', '规费': '0.04'},
            {'过户费': '0', '剩余金额': '5939.99', '清算金额': '5000', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20161011', '规费': '0'},
            {'过户费': '0.01', '剩余金额': '5548.98', '清算金额': '-391.01', '结算费': '0', '剩余数量': '100', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '386', '净佣金': '4.97', '成交编号': '1801002407', '业务名称': '证券买入', '证券名称': '怡球资源',
             '成交价格': '3.86', '证券代码': '601388', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.03'},
            {'过户费': '0', '剩余金额': '5295.98', '清算金额': '-253', '结算费': '0', '剩余数量': '100', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '248', '净佣金': '4.99', '成交编号': '1801006292', '业务名称': '证券买入', '证券名称': '山东钢铁',
             '成交价格': '2.48', '证券代码': '600022', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.01'},
            {'过户费': '0.01', '剩余金额': '4978.97', '清算金额': '-317.01', '结算费': '0', '剩余数量': '100', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '312', '净佣金': '4.97', '成交编号': '1801006304', '业务名称': '证券买入', '证券名称': '内蒙华电',
             '成交价格': '3.12', '证券代码': '600863', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.03'},
            {'过户费': '0.01', '剩余金额': '4550.96', '清算金额': '-428.01', '结算费': '0', '剩余数量': '100', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '423', '净佣金': '4.97', '成交编号': '1801006345', '业务名称': '证券买入', '证券名称': '北辰实业',
             '成交价格': '4.23', '证券代码': '601588', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.03'},
            {'过户费': '0.01', '剩余金额': '4133.95', '清算金额': '-417.01', '结算费': '0', '剩余数量': '100', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '412', '净佣金': '4.97', '成交编号': '1801006352', '业务名称': '证券买入', '证券名称': '太原重工',
             '成交价格': '4.12', '证券代码': '600169', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.03'},
            {'过户费': '0.01', '剩余金额': '3780.94', '清算金额': '-353.01', '结算费': '0', '剩余数量': '100', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '348', '净佣金': '4.97', '成交编号': '1801006455', '业务名称': '证券买入', '证券名称': '营口港',
             '成交价格': '3.48', '证券代码': '600317', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.03'},
            {'过户费': '0', '剩余金额': '3033.94', '清算金额': '-747', '结算费': '0', '剩余数量': '200', '股东代码': '0214229323',
             '成交数量': '200', '成交金额': '742', '净佣金': '4.94', '成交编号': 'DA004957', '业务名称': '证券买入', '证券名称': '巨轮智能',
             '成交价格': '3.71', '证券代码': '002031', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.06'},
            {'过户费': '0', '剩余金额': '2290.94', '清算金额': '-743', '结算费': '0', '剩余数量': '400', '股东代码': '0214229323',
             '成交数量': '200', '成交金额': '738', '净佣金': '4.94', '成交编号': 'DA004959', '业务名称': '证券买入', '证券名称': '巨轮智能',
             '成交价格': '3.69', '证券代码': '002031', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.06'},
            {'过户费': '0', '剩余金额': '1871.94', '清算金额': '-419', '结算费': '0', '剩余数量': '100', '股东代码': '0214229323',
             '成交数量': '100', '成交金额': '414', '净佣金': '4.96', '成交编号': 'DA006906', '业务名称': '证券买入', '证券名称': '华联股份',
             '成交价格': '4.14', '证券代码': '000882', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.04'},
            {'过户费': '0', '剩余金额': '1605.94', '清算金额': '-266', '结算费': '0', '剩余数量': '100', '股东代码': '0214229323',
             '成交数量': '100', '成交金额': '261', '净佣金': '4.97', '成交编号': 'DA006920', '业务名称': '证券买入', '证券名称': '铜陵有色',
             '成交价格': '2.61', '证券代码': '000630', '附加费': '0', '印花税': '0', '成交日期': '20161011', '规费': '0.03'},
            {'过户费': '0', '剩余金额': '7605.94', '清算金额': '6000', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20161012', '规费': '0'},
            {'过户费': '0', '剩余金额': '5765.94', '清算金额': '-1840', '结算费': '0', '剩余数量': '500', '股东代码': '0214229323',
             '成交数量': '500', '成交金额': '1835', '净佣金': '4.83', '成交编号': 'DA005562', '业务名称': '证券买入', '证券名称': '漳泽电力',
             '成交价格': '3.67', '证券代码': '000767', '附加费': '0', '印花税': '0', '成交日期': '20161012', '规费': '0.17'},
            {'过户费': '0', '剩余金额': '3555.94', '清算金额': '-2210', '结算费': '0', '剩余数量': '500', '股东代码': '0214229323',
             '成交数量': '500', '成交金额': '2205', '净佣金': '4.81', '成交编号': 'DA005568', '业务名称': '证券买入', '证券名称': '汉缆股份',
             '成交价格': '4.41', '证券代码': '002498', '附加费': '0', '印花税': '0', '成交日期': '20161012', '规费': '0.19'},
            {'过户费': '0.03', '剩余金额': '1810.91', '清算金额': '-1745.03', '结算费': '0', '剩余数量': '600', '股东代码': 'A645322850',
             '成交数量': '500', '成交金额': '1740', '净佣金': '4.89', '成交编号': '1801001619', '业务名称': '证券买入', '证券名称': '营口港',
             '成交价格': '3.48', '证券代码': '600317', '附加费': '0', '印花税': '0', '成交日期': '20161013', '规费': '0.11'},
            {'过户费': '0', '剩余金额': '2810.91', '清算金额': '1000', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20161014', '规费': '0'},
            {'过户费': '0', '剩余金额': '8310.91', '清算金额': '5500', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20161014', '规费': '0'},
            {'过户费': '0.05', '剩余金额': '5975.85', '清算金额': '-2335.06', '结算费': '0', '剩余数量': '1100', '股东代码': 'A645322850',
             '成交数量': '1000', '成交金额': '2330', '净佣金': '4.85', '成交编号': '1801005914', '业务名称': '证券买入', '证券名称': '海润光伏',
             '成交价格': '2.33', '证券代码': '600401', '附加费': '0', '印花税': '0', '成交日期': '20161014', '规费': '0.16'},
            {'过户费': '0', '剩余金额': '7858.96', '清算金额': '1883.11', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '500', '成交金额': '1890', '净佣金': '4.83', '成交编号': 'DA001812', '业务名称': '证券卖出', '证券名称': '漳泽电力',
             '成交价格': '3.78', '证券代码': '000767', '附加费': '0', '印花税': '1.89', '成交日期': '20161014', '规费': '0.17'},
            {'过户费': '0', '剩余金额': '6026.96', '清算金额': '-1832', '结算费': '0', '剩余数量': '800', '股东代码': '0214229323',
             '成交数量': '700', '成交金额': '1827', '净佣金': '4.83', '成交编号': 'DA002041', '业务名称': '证券买入', '证券名称': '铜陵有色',
             '成交价格': '2.61', '证券代码': '000630', '附加费': '0', '印花税': '0', '成交日期': '20161014', '规费': '0.17'},
            {'过户费': '0', '剩余金额': '4383.96', '清算金额': '-1643', '结算费': '0', '剩余数量': '600', '股东代码': '0214229323',
             '成交数量': '600', '成交金额': '1638', '净佣金': '4.86', '成交编号': 'DA002282', '业务名称': '证券买入', '证券名称': '中弘股份',
             '成交价格': '2.73', '证券代码': '000979', '附加费': '0', '印花税': '0', '成交日期': '20161014', '规费': '0.14'},
            {'过户费': '0', '剩余金额': '1638.07', '清算金额': '-2745.89', '结算费': '0', '剩余数量': '1600', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '2740', '净佣金': '5.66', '成交编号': 'DA004009', '业务名称': '证券买入', '证券名称': '中弘股份',
             '成交价格': '2.74', '证券代码': '000979', '附加费': '0', '印花税': '0', '成交日期': '20161014', '规费': '0.23'},
            {'过户费': '0.03', '剩余金额': '139.04', '清算金额': '-1499.03', '结算费': '0', '剩余数量': '700', '股东代码': 'A645322850',
             '成交数量': '600', '成交金额': '1494', '净佣金': '4.9', '成交编号': '1801005178', '业务名称': '证券买入', '证券名称': '山东钢铁',
             '成交价格': '2.49', '证券代码': '600022', '附加费': '0', '印花税': '0', '成交日期': '20161017', '规费': '0.1'},
            {'过户费': '0', '剩余金额': '3139.04', '清算金额': '3000', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20161018', '规费': '0'},
            {'过户费': '0', '剩余金额': '341.04', '清算金额': '-2798', '结算费': '0', '剩余数量': '900', '股东代码': '0214229323',
             '成交数量': '800', '成交金额': '2792', '净佣金': '5.74', '成交编号': 'DA000545', '业务名称': '证券买入', '证券名称': '大康农业',
             '成交价格': '3.49', '证券代码': '002505', '附加费': '0', '印花税': '0', '成交日期': '20161018', '规费': '0.26'},
            {'过户费': '0.01', '剩余金额': '738.63', '清算金额': '397.59', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '403', '净佣金': '4.97', '成交编号': '1801002990', '业务名称': '证券卖出', '证券名称': '怡球资源',
             '成交价格': '4.03', '证券代码': '601388', '附加费': '0', '印花税': '0.4', '成交日期': '20161019', '规费': '0.03'},
            {'过户费': '0', '剩余金额': '3003.36', '清算金额': '2264.73', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '800', '成交金额': '2272', '净佣金': '4.79', '成交编号': 'DA000935', '业务名称': '证券卖出', '证券名称': '铜陵有色',
             '成交价格': '2.84', '证券代码': '000630', '附加费': '0', '印花税': '2.27', '成交日期': '20161019', '规费': '0.21'},
            {'过户费': '0', '剩余金额': '99.13', '清算金额': '-2904.23', '结算费': '0', '剩余数量': '800', '股东代码': '0214229323',
             '成交数量': '700', '成交金额': '2898', '净佣金': '5.97', '成交编号': 'DA006225', '业务名称': '证券买入', '证券名称': '华联股份',
             '成交价格': '4.14', '证券代码': '000882', '附加费': '0', '印花税': '0', '成交日期': '20161019', '规费': '0.26'},
            {'过户费': '0', '剩余金额': '1692.53', '清算金额': '1593.4', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '400', '成交金额': '1600', '净佣金': '4.86', '成交编号': 'DA001803', '业务名称': '证券卖出', '证券名称': '巨轮智能',
             '成交价格': '4', '证券代码': '002031', '附加费': '0', '印花税': '1.6', '成交日期': '20161020', '规费': '0.14'},
            {'过户费': '0.03', '剩余金额': '205.5', '清算金额': '-1487.03', '结算费': '0', '剩余数量': '1300', '股东代码': 'A645322850',
             '成交数量': '600', '成交金额': '1482', '净佣金': '4.9', '成交编号': '1801002516', '业务名称': '证券买入', '证券名称': '山东钢铁',
             '成交价格': '2.47', '证券代码': '600022', '附加费': '0', '印花税': '0', '成交日期': '20161021', '规费': '0.1'},
            {'过户费': '0.01', '剩余金额': '625.06', '清算金额': '419.56', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '425', '净佣金': '4.97', '成交编号': '1801003558', '业务名称': '证券卖出', '证券名称': '太原重工',
             '成交价格': '4.25', '证券代码': '600169', '附加费': '0', '印花税': '0.43', '成交日期': '20161021', '规费': '0.03'},
            {'过户费': '0', '剩余金额': '25.06', '清算金额': '-600', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0', '成交金额': '0',
             '净佣金': '0', '成交编号': '', '业务名称': '证券转银行', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0', '印花税': '0',
             '成交日期': '20161107', '规费': '0'},
            {'过户费': '0', '剩余金额': '10025.06', '清算金额': '10000', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20161108', '规费': '0'},
            {'过户费': '0', '剩余金额': '5142.59', '清算金额': '-4882.47', '结算费': '0', '剩余数量': '2000', '股东代码': '0214229323',
             '成交数量': '1200', '成交金额': '4872', '净佣金': '10.03', '成交编号': 'DA006807', '业务名称': '证券买入', '证券名称': '华联股份',
             '成交价格': '4.06', '证券代码': '000882', '附加费': '0', '印花税': '0', '成交日期': '20161108', '规费': '0.44'},
            {'过户费': '0', '剩余金额': '1103.93', '清算金额': '-4038.66', '结算费': '0', '剩余数量': '3000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '4030', '净佣金': '8.28', '成交编号': 'DA000785', '业务名称': '证券买入', '证券名称': '华联股份',
             '成交价格': '4.03', '证券代码': '000882', '附加费': '0', '印花税': '0', '成交日期': '20161109', '规费': '0.38'},
            {'过户费': '0.07', '剩余金额': '4421.37', '清算金额': '3317.44', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '1300', '成交金额': '3328', '净佣金': '6.93', '成交编号': '1801007209', '业务名称': '证券卖出', '证券名称': '山东钢铁',
             '成交价格': '2.56', '证券代码': '600022', '附加费': '0', '印花税': '3.33', '成交日期': '20161110', '规费': '0.23'},
            {'过户费': '0', '剩余金额': '8458.61', '清算金额': '4037.24', '结算费': '0', '剩余数量': '2000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '4050', '净佣金': '8.35', '成交编号': 'DA006043', '业务名称': '证券卖出', '证券名称': '华联股份',
             '成交价格': '4.05', '证券代码': '000882', '附加费': '0', '印花税': '4.05', '成交日期': '20161110', '规费': '0.36'},
            {'过户费': '0', '剩余金额': '4660.46', '清算金额': '-3798.15', '结算费': '0', '剩余数量': '1000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '3790', '净佣金': '7.81', '成交编号': 'DA009623', '业务名称': '证券买入', '证券名称': '巨轮智能',
             '成交价格': '3.79', '证券代码': '002031', '附加费': '0', '印花税': '0', '成交日期': '20161115', '规费': '0.34'},
            {'过户费': '0.01', '剩余金额': '4991.11', '清算金额': '330.65', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '336', '净佣金': '4.97', '成交编号': '1801007121', '业务名称': '证券卖出', '证券名称': '海南航空',
             '成交价格': '3.36', '证券代码': '600221', '附加费': '0', '印花税': '0.34', '成交日期': '20161117', '规费': '0.03'},
            {'过户费': '0', '剩余金额': '1293.18', '清算金额': '-3697.93', '结算费': '0', '剩余数量': '1000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '3690', '净佣金': '7.61', '成交编号': 'DA007839', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '3.69', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20161117', '规费': '0.32'},
            {'过户费': '0', '剩余金额': '293.17', '清算金额': '-1000.01', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '10', '成交金额': '1000', '净佣金': '0.01', '成交编号': 'DA008909', '业务名称': '融券回购', '证券名称': 'Ｒ-001',
             '成交价格': '5.31', '证券代码': '131810', '附加费': '0', '印花税': '0', '成交日期': '20161117', '规费': '0'},
            {'过户费': '0', '剩余金额': '1293.32', '清算金额': '1000.15', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '10', '成交金额': '1000', '净佣金': '0', '成交编号': 'DA008909', '业务名称': '融券购回', '证券名称': 'Ｒ-001',
             '成交价格': '5.31', '证券代码': '131810', '附加费': '0', '印花税': '0', '成交日期': '20161118', '规费': '0'},
            {'过户费': '0.01', '剩余金额': '1617.98', '清算金额': '324.66', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '330', '净佣金': '4.97', '成交编号': '1801003820', '业务名称': '证券卖出', '证券名称': '内蒙华电',
             '成交价格': '3.3', '证券代码': '600863', '附加费': '0', '印花税': '0.33', '成交日期': '20161121', '规费': '0.03'},
            {'过户费': '0.01', '剩余金额': '2050.53', '清算金额': '432.55', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '438', '净佣金': '4.97', '成交编号': '1801006139', '业务名称': '证券卖出', '证券名称': '北辰实业',
             '成交价格': '4.38', '证券代码': '601588', '附加费': '0', '印花税': '0.44', '成交日期': '20161123', '规费': '0.03'},
            {'过户费': '0', '剩余金额': '6628.07', '清算金额': '4577.54', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '1600', '成交金额': '4592', '净佣金': '9.47', '成交编号': 'DA007236', '业务名称': '证券卖出', '证券名称': '中弘股份',
             '成交价格': '2.87', '证券代码': '000979', '附加费': '0', '印花税': '4.59', '成交日期': '20161123', '规费': '0.4'},
            {'过户费': '0', '剩余金额': '1056.12', '清算金额': '-5571.95', '结算费': '0', '剩余数量': '2000', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '5560', '净佣金': '11.46', '成交编号': 'DA000183', '业务名称': '证券买入', '证券名称': '京东方Ａ',
             '成交价格': '2.78', '证券代码': '000725', '附加费': '0', '印花税': '0', '成交日期': '20161128', '规费': '0.49'},
            {'过户费': '0.11', '剩余金额': '-4515.94', '清算金额': '-5572.06', '结算费': '0', '剩余数量': '2000', '股东代码': 'A645322850',
             '成交数量': '2000', '成交金额': '5560', '净佣金': '11.57', '成交编号': '1801004399', '业务名称': '证券买入', '证券名称': '华锐风电',
             '成交价格': '2.78', '证券代码': '601558', '附加费': '0', '印花税': '0', '成交日期': '20161205', '规费': '0.38'},
            {'过户费': '0', '剩余金额': '1345.54', '清算金额': '5861.48', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '5880', '净佣金': '12.11', '成交编号': 'DA004505', '业务名称': '证券卖出', '证券名称': '京东方Ａ',
             '成交价格': '2.94', '证券代码': '000725', '附加费': '0', '印花税': '5.88', '成交日期': '20161205', '规费': '0.53'},
            {'过户费': '0', '剩余金额': '5223.29', '清算金额': '3877.75', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '3890', '净佣金': '8.01', '成交编号': 'DA008865', '业务名称': '证券卖出', '证券名称': '大 东 南',
             '成交价格': '3.89', '证券代码': '002263', '附加费': '0', '印花税': '3.89', '成交日期': '20161205', '规费': '0.35'},
            {'过户费': '0', '剩余金额': '1515.33', '清算金额': '-3707.96', '结算费': '0', '剩余数量': '2000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '3700', '净佣金': '7.64', '成交编号': 'DA009047', '业务名称': '证券买入', '证券名称': '巨轮智能',
             '成交价格': '3.7', '证券代码': '002031', '附加费': '0', '印花税': '0', '成交日期': '20161205', '规费': '0.32'},
            {'过户费': '0', '剩余金额': '5552.57', '清算金额': '4037.24', '结算费': '0', '剩余数量': '1000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '4050', '净佣金': '8.35', '成交编号': 'DA005836', '业务名称': '证券卖出', '证券名称': '华联股份',
             '成交价格': '4.05', '证券代码': '000882', '附加费': '0', '印花税': '4.05', '成交日期': '20161206', '规费': '0.36'},
            {'过户费': '0', '剩余金额': '1654.21', '清算金额': '-3898.36', '结算费': '0', '剩余数量': '1000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '3890', '净佣金': '8.01', '成交编号': 'DA005859', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '3.89', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20161206', '规费': '0.35'},
            {'过户费': '0', '剩余金额': '5741.29', '清算金额': '4087.08', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '4100', '净佣金': '8.46', '成交编号': 'DA006094', '业务名称': '证券卖出', '证券名称': '大 东 南',
             '成交价格': '4.1', '证券代码': '002263', '附加费': '0', '印花税': '4.1', '成交日期': '20161207', '规费': '0.36'},
            {'过户费': '0', '剩余金额': '169.34', '清算金额': '-5571.95', '结算费': '0', '剩余数量': '2000', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '5560', '净佣金': '11.46', '成交编号': 'DA006591', '业务名称': '证券买入', '证券名称': '中弘股份',
             '成交价格': '2.78', '证券代码': '000979', '附加费': '0', '印花税': '0', '成交日期': '20161207', '规费': '0.49'},
            {'过户费': '0', '剩余金额': '4904.38', '清算金额': '4735.04', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '4750', '净佣金': '9.78', '成交编号': 'DA002307', '业务名称': '证券卖出', '证券名称': '华联股份',
             '成交价格': '4.75', '证券代码': '000882', '附加费': '0', '印花税': '4.75', '成交日期': '20161208', '规费': '0.43'},
            {'过户费': '0', '剩余金额': '158.2', '清算金额': '-4746.18', '结算费': '0', '剩余数量': '1600', '股东代码': '0214229323',
             '成交数量': '1600', '成交金额': '4736', '净佣金': '9.77', '成交编号': 'DA002494', '业务名称': '证券买入', '证券名称': '京东方Ａ',
             '成交价格': '2.96', '证券代码': '000725', '附加费': '0', '印花税': '0', '成交日期': '20161208', '规费': '0.41'},
            {'过户费': '0', '剩余金额': '10158.2', '清算金额': '10000', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20161220', '规费': '0'},
            {'过户费': '0', '剩余金额': '17176.02', '清算金额': '7017.82', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '7040', '净佣金': '14.52', '成交编号': 'DA001300', '业务名称': '证券卖出', '证券名称': '巨轮智能',
             '成交价格': '3.52', '证券代码': '002031', '附加费': '0', '印花税': '7.04', '成交日期': '20161220', '规费': '0.62'},
            {'过户费': '0', '剩余金额': '20405.81', '清算金额': '3229.79', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '900', '成交金额': '3240', '净佣金': '6.69', '成交编号': 'DA001321', '业务名称': '证券卖出', '证券名称': '大康农业',
             '成交价格': '3.6', '证券代码': '002505', '附加费': '0', '印花税': '3.24', '成交日期': '20161220', '规费': '0.28'},
            {'过户费': '0', '剩余金额': '11807.36', '清算金额': '-8598.45', '结算费': '0', '剩余数量': '2000', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '8580', '净佣金': '17.67', '成交编号': 'DA001361', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '4.29', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20161220', '规费': '0.78'},
            {'过户费': '0', '剩余金额': '11809.42', '清算金额': '2.06', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '利息归本', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20161221', '规费': '0'},
            {'过户费': '0', '剩余金额': '3050.63', '清算金额': '-8758.79', '结算费': '0', '剩余数量': '4000', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '8740', '净佣金': '18.02', '成交编号': 'DA000358', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '4.37', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20161221', '规费': '0.77'},
            {'过户费': '0', '剩余金额': '11862.78', '清算金额': '8812.15', '结算费': '0', '剩余数量': '2000', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '8840', '净佣金': '18.22', '成交编号': 'DA000045', '业务名称': '证券卖出', '证券名称': '大 东 南',
             '成交价格': '4.42', '证券代码': '002263', '附加费': '0', '印花税': '8.84', '成交日期': '20161222', '规费': '0.79'},
            {'过户费': '0', '剩余金额': '16268.86', '清算金额': '4406.08', '结算费': '0', '剩余数量': '1000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '4420', '净佣金': '9.1', '成交编号': 'DA001750', '业务名称': '证券卖出', '证券名称': '大 东 南',
             '成交价格': '4.42', '证券代码': '002263', '附加费': '0', '印花税': '4.42', '成交日期': '20161222', '规费': '0.4'},
            {'过户费': '0', '剩余金额': '7129.25', '清算金额': '-9139.61', '结算费': '0', '剩余数量': '4800', '股东代码': '0214229323',
             '成交数量': '3200', '成交金额': '9120', '净佣金': '18.81', '成交编号': 'DA002561', '业务名称': '证券买入', '证券名称': '京东方Ａ',
             '成交价格': '2.85', '证券代码': '000725', '附加费': '0', '印花税': '0', '成交日期': '20161222', '规费': '0.8'},
            {'过户费': '0', '剩余金额': '2759.88', '清算金额': '-4369.37', '结算费': '0', '剩余数量': '2000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '4360', '净佣金': '8.98', '成交编号': 'DA003577', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '4.36', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20161222', '规费': '0.39'},
            {'过户费': '0', '剩余金额': '210.41', '清算金额': '-2549.47', '结算费': '0', '剩余数量': '2600', '股东代码': '0214229323',
             '成交数量': '600', '成交金额': '2544', '净佣金': '5.25', '成交编号': 'DA001499', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '4.24', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20161223', '规费': '0.22'},
            {'过户费': '0.05', '剩余金额': '2754.32', '清算金额': '2543.91', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '1100', '成交金额': '2552', '净佣金': '5.32', '成交编号': '1801002321', '业务名称': '证券卖出', '证券名称': '海润光伏',
             '成交价格': '2.32', '证券代码': '600401', '附加费': '0', '印花税': '2.55', '成交日期': '20161226', '规费': '0.17'},
            {'过户费': '0.04', '剩余金额': '4811.22', '清算金额': '2056.9', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '600', '成交金额': '2064', '净佣金': '4.86', '成交编号': '1801002389', '业务名称': '证券卖出', '证券名称': '营口港',
             '成交价格': '3.44', '证券代码': '600317', '附加费': '0', '印花税': '2.06', '成交日期': '20161226', '规费': '0.14'},
            {'过户费': '0.11', '剩余金额': '10233.97', '清算金额': '5422.75', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '2000', '成交金额': '5440', '净佣金': '11.33', '成交编号': '1801002645', '业务名称': '证券卖出', '证券名称': '华锐风电',
             '成交价格': '2.72', '证券代码': '601558', '附加费': '0', '印花税': '5.44', '成交日期': '20161226', '规费': '0.37'},
            {'过户费': '0', '剩余金额': '15497.34', '清算金额': '5263.37', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '5280', '净佣金': '10.87', '成交编号': 'DA003391', '业务名称': '证券卖出', '证券名称': '中弘股份',
             '成交价格': '2.64', '证券代码': '000979', '附加费': '0', '印花税': '5.28', '成交日期': '20161226', '规费': '0.48'},
            {'过户费': '0', '剩余金额': '28895', '清算金额': '13397.66', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '4800', '成交金额': '13440', '净佣金': '27.71', '成交编号': 'DA003591', '业务名称': '证券卖出', '证券名称': '京东方Ａ',
             '成交价格': '2.8', '证券代码': '000725', '附加费': '0', '印花税': '13.44', '成交日期': '20161226', '规费': '1.19'},
            {'过户费': '0', '剩余金额': '405.88', '清算金额': '-28489.12', '结算费': '0', '剩余数量': '9500', '股东代码': '0214229323',
             '成交数量': '6900', '成交金额': '28428', '净佣金': '58.6', '成交编号': 'DA003823', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '4.12', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20161226', '规费': '2.52'},
            {'过户费': '0', '剩余金额': '11343.32', '清算金额': '10937.44', '结算费': '0', '剩余数量': '6900', '股东代码': '0214229323',
             '成交数量': '2600', '成交金额': '10972', '净佣金': '22.62', '成交编号': 'DA012269', '业务名称': '证券卖出', '证券名称': '大 东 南',
             '成交价格': '4.22', '证券代码': '002263', '附加费': '0', '印花税': '10.97', '成交日期': '20161226', '规费': '0.97'},
            {'过户费': '0', '剩余金额': '373.79', '清算金额': '-10969.53', '结算费': '0', '剩余数量': '9500', '股东代码': '0214229323',
             '成交数量': '2600', '成交金额': '10946', '净佣金': '22.56', '成交编号': 'DA006351', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '4.21', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20161227', '规费': '0.97'},
            {'过户费': '0', '剩余金额': '469.79', '清算金额': '96', '结算费': '0', '剩余数量': '0', '股东代码': '481379026204', '成交数量': '88',
             '成交金额': '96.48', '净佣金': '0', '成交编号': '', '业务名称': '基金赎回拨入', '证券名称': '工银香港中小盘股', '成交价格': '108.8',
             '证券代码': '002379', '附加费': '0', '印花税': '0', '成交日期': '20161230', '规费': '0'},
            {'过户费': '0', '剩余金额': '520.82', '清算金额': '51.03', '结算费': '0', '剩余数量': '0', '股东代码': '99F605029234',
             '成交数量': '31', '成交金额': '51.29', '净佣金': '0', '成交编号': '', '业务名称': '基金赎回拨入', '证券名称': '交银环球', '成交价格': '164.7',
             '证券代码': '519696', '附加费': '0', '印花税': '0', '成交日期': '20161230', '规费': '0'},
            {'过户费': '0', '剩余金额': '3020.82', '清算金额': '2500', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20170104', '规费': '0'},
            {'过户费': '0', '剩余金额': '5173.66', '清算金额': '2152.84', '结算费': '0', '剩余数量': '0', '股东代码': '0214229323',
             '成交数量': '500', '成交金额': '2160', '净佣金': '4.81', '成交编号': 'DA000998', '业务名称': '证券卖出', '证券名称': '汉缆股份',
             '成交价格': '4.32', '证券代码': '002498', '附加费': '0', '印花税': '2.16', '成交日期': '20170111', '规费': '0.19'},
            {'过户费': '0', '剩余金额': '170.93', '清算金额': '-5002.73', '结算费': '0', '剩余数量': '10700', '股东代码': '0214229323',
             '成交数量': '1200', '成交金额': '4992', '净佣金': '10.29', '成交编号': 'DA001175', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '4.16', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20170111', '规费': '0.44'},
            {'过户费': '0.11', '剩余金额': '-5385.1', '清算金额': '-5556.03', '结算费': '0', '剩余数量': '400', '股东代码': 'A645322850',
             '成交数量': '400', '成交金额': '5544', '净佣金': '11.54', '成交编号': '1801003296', '业务名称': '证券买入', '证券名称': '运盛医疗',
             '成交价格': '13.86', '证券代码': '600767', '附加费': '0', '印花税': '0', '成交日期': '20170209', '规费': '0.38'},
            {'过户费': '0', '剩余金额': '1274.86', '清算金额': '6659.96', '结算费': '0', '剩余数量': '9000', '股东代码': '0214229323',
             '成交数量': '1700', '成交金额': '6681', '净佣金': '13.77', '成交编号': 'DA003088', '业务名称': '证券卖出', '证券名称': '大 东 南',
             '成交价格': '3.93', '证券代码': '002263', '附加费': '0', '印花税': '6.68', '成交日期': '20170209', '规费': '0.59'},
            {'过户费': '0.16', '剩余金额': '-6742.5', '清算金额': '-8017.36', '结算费': '0', '剩余数量': '500', '股东代码': 'A645322850',
             '成交数量': '500', '成交金额': '8000', '净佣金': '16.65', '成交编号': '1801000313', '业务名称': '证券买入', '证券名称': '福达股份',
             '成交价格': '16', '证券代码': '603166', '附加费': '0', '印花税': '0', '成交日期': '20170213', '规费': '0.55'},
            {'过户费': '0', '剩余金额': '1052.86', '清算金额': '7795.36', '结算费': '0', '剩余数量': '7000', '股东代码': '0214229323',
             '成交数量': '2000', '成交金额': '7820', '净佣金': '16.1', '成交编号': 'DA000229', '业务名称': '证券卖出', '证券名称': '大 东 南',
             '成交价格': '3.91', '证券代码': '002263', '附加费': '0', '印花税': '7.83', '成交日期': '20170213', '规费': '0.71'},
            {'过户费': '0.11', '剩余金额': '6738.79', '清算金额': '5685.93', '结算费': '0', '剩余数量': '0', '股东代码': 'A645322850',
             '成交数量': '400', '成交金额': '5704', '净佣金': '11.87', '成交编号': '1801001960', '业务名称': '证券卖出', '证券名称': '运盛医疗',
             '成交价格': '14.26', '证券代码': '600767', '附加费': '0', '印花税': '5.7', '成交日期': '20170306', '规费': '0.39'},
            {'过户费': '0', '剩余金额': '1347.22', '清算金额': '-5391.57', '结算费': '0', '剩余数量': '400', '股东代码': '0214229323',
             '成交数量': '400', '成交金额': '5380', '净佣金': '11.09', '成交编号': 'DA005520', '业务名称': '证券买入', '证券名称': '搜于特',
             '成交价格': '13.45', '证券代码': '002503', '附加费': '0', '印花税': '0', '成交日期': '20170306', '规费': '0.48'},
            {'过户费': '0', '剩余金额': '11347.22', '清算金额': '10000', '结算费': '0', '剩余数量': '0', '股东代码': '', '成交数量': '0',
             '成交金额': '0', '净佣金': '0', '成交编号': '', '业务名称': '银行转证券', '证券名称': '', '成交价格': '0', '证券代码': '', '附加费': '0',
             '印花税': '0', '成交日期': '20170313', '规费': '0'},
            {'过户费': '0.06', '剩余金额': '8306.64', '清算金额': '-3040.58', '结算费': '0', '剩余数量': '700', '股东代码': 'A645322850',
             '成交数量': '200', '成交金额': '3034', '净佣金': '6.31', '成交编号': '1801000909', '业务名称': '证券买入', '证券名称': '福达股份',
             '成交价格': '15.17', '证券代码': '603166', '附加费': '0', '印花税': '0', '成交日期': '20170313', '规费': '0.21'},
            {'过户费': '0.03', '剩余金额': '9843.07', '清算金额': '1536.43', '结算费': '0', '剩余数量': '600', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '1543', '净佣金': '4.89', '成交编号': '1801004140', '业务名称': '证券卖出', '证券名称': '福达股份',
             '成交价格': '15.43', '证券代码': '603166', '附加费': '0', '印花税': '1.54', '成交日期': '20170313', '规费': '0.11'},
            {'过户费': '0.06', '剩余金额': '12917.3', '清算金额': '3074.23', '结算费': '0', '剩余数量': '400', '股东代码': 'A645322850',
             '成交数量': '200', '成交金额': '3084', '净佣金': '6.42', '成交编号': '1801004148', '业务名称': '证券卖出', '证券名称': '福达股份',
             '成交价格': '15.42', '证券代码': '603166', '附加费': '0', '印花税': '3.08', '成交日期': '20170313', '规费': '0.21'},
            {'过户费': '0', '剩余金额': '9079.07', '清算金额': '-3838.23', '结算费': '0', '剩余数量': '8000', '股东代码': '0214229323',
             '成交数量': '1000', '成交金额': '3830', '净佣金': '7.88', '成交编号': 'DA000139', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '3.83', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20170313', '规费': '0.35'},
            {'过户费': '0', '剩余金额': '5173.69', '清算金额': '-3905.38', '结算费': '0', '剩余数量': '700', '股东代码': '0214229323',
             '成交数量': '300', '成交金额': '3897', '净佣金': '8.03', '成交编号': 'DA001662', '业务名称': '证券买入', '证券名称': '搜于特',
             '成交价格': '12.99', '证券代码': '002503', '附加费': '0', '印花税': '0', '成交日期': '20170313', '规费': '0.35'},
            {'过户费': '0.03', '剩余金额': '3607.66', '清算金额': '-1566.03', '结算费': '0', '剩余数量': '500', '股东代码': 'A645322850',
             '成交数量': '100', '成交金额': '1561', '净佣金': '4.89', '成交编号': '1801003198', '业务名称': '证券买入', '证券名称': '福达股份',
             '成交价格': '15.61', '证券代码': '603166', '附加费': '0', '印花税': '0', '成交日期': '20170314', '规费': '0.11'},
            {'过户费': '0', '剩余金额': '171.29', '清算金额': '-3436.37', '结算费': '0', '剩余数量': '8900', '股东代码': '0214229323',
             '成交数量': '900', '成交金额': '3429', '净佣金': '7.06', '成交编号': 'DA008233', '业务名称': '证券买入', '证券名称': '大 东 南',
             '成交价格': '3.81', '证券代码': '002263', '附加费': '0', '印花税': '0', '成交日期': '20170314', '规费': '0.31'}]
        col_list = ['成交日期', '业务名称', '证券代码', '证券名称', '成交价格', '成交数量', '剩余数量', '成交金额', '清算金额', '剩余金额', '净佣金', '规费', '印花税',
                    '过户费', '结算费', '附加费', '成交编号', '股东代码']

        self.main_layout = CustomTable(col_list, data)
        return self.main_layout


if __name__ == '__main__':
    a = Test()
    a.run()
